---
kind: type
id: T:Autodesk.Revit.DB.Visual.Marble
source: html/729b243c-c4ee-64bd-f482-7164ab4dcffc.htm
---
# Autodesk.Revit.DB.Visual.Marble

A static class that provides access to the property names that appear in the Marble visual asset schema.

## Syntax (C#)
```csharp
public static class Marble
```